# Initial staff cleaning

In [93]:
#  access the data 
import pandas as pd
dataStaff=pd.read_csv('J:\\SATS\\SATS_RAM.csv')

In [94]:
dataStaff=dataStaff[dataStaff['Orientation']=='Arrival']

In [95]:
dataStaff.shape

(10113, 9)

In [100]:
# remove .0 from ET column
dataStaff['ET']=dataStaff['ET'].astype(str).str[:-2]

In [101]:
dataStaff.tail()

      Flight Date Orientation  Flight    ST    ET  RLO   RSM  EO   AA
20208  30-11-2022     Arrival  SQ 193  2315  2304   1.0    2   1  1.0
20209  30-11-2022     Arrival  TR 653  2315  2353   1.0    2   1  1.0
20210  30-11-2022     Arrival  SQ 713  2330   105   1.0    2   1  1.0
20212  30-11-2022     Arrival  TR 617  2340  2353   1.0    3   1  1.0
20218  30-11-2022     Arrival  SQ 897  2355  2338   1.0    1   1  1.0

In [102]:
# dataStaff['ET'] = '{:0>4}'.format(dataStaff['ET'])
# set ET to string
dataStaff['ET']=dataStaff['ET'].astype(str)
dataStaff['ET'] = dataStaff['ET'].apply(lambda x: '{:0>4}'.format(x))
dataStaff.tail()

      Flight Date Orientation  Flight    ST    ET  RLO   RSM  EO   AA
20208  30-11-2022     Arrival  SQ 193  2315  2304   1.0    2   1  1.0
20209  30-11-2022     Arrival  TR 653  2315  2353   1.0    2   1  1.0
20210  30-11-2022     Arrival  SQ 713  2330  0105   1.0    2   1  1.0
20212  30-11-2022     Arrival  TR 617  2340  2353   1.0    3   1  1.0
20218  30-11-2022     Arrival  SQ 897  2355  2338   1.0    1   1  1.0

In [5]:
dataStaff.tail()

      Flight Date Orientation  Flight    ST      ET  RLO   RSM  EO   AA
20208  30-11-2022     Arrival  SQ 193  2315  2304.0   1.0    2   1  1.0
20209  30-11-2022     Arrival  TR 653  2315  2353.0   1.0    2   1  1.0
20210  30-11-2022     Arrival  SQ 713  2330   105.0   1.0    2   1  1.0
20212  30-11-2022     Arrival  TR 617  2340  2353.0   1.0    3   1  1.0
20218  30-11-2022     Arrival  SQ 897  2355  2338.0   1.0    1   1  1.0

In [6]:
# any null values?
dataStaff['ET'].isnull().sum()

0

In [7]:
# insert : into ET
dataStaff['ET'] = dataStaff['ET'].str[:2] + ':' + dataStaff['ET'].str[2:]

In [8]:
dataStaff.tail()

      Flight Date Orientation  Flight    ST       ET  RLO   RSM  EO   AA
20208  30-11-2022     Arrival  SQ 193  2315  23:04.0   1.0    2   1  1.0
20209  30-11-2022     Arrival  TR 653  2315  23:53.0   1.0    2   1  1.0
20210  30-11-2022     Arrival  SQ 713  2330   10:5.0   1.0    2   1  1.0
20212  30-11-2022     Arrival  TR 617  2340  23:53.0   1.0    3   1  1.0
20218  30-11-2022     Arrival  SQ 897  2355  23:38.0   1.0    1   1  1.0

In [9]:
# convert ET to datetime
# dataStaff['ET'] = pd.to_datetime(dataStaff['ET'])
dataStaff['ET'].shape

(10113,)

In [10]:
# import pandas as pd
# import re

# # dataStaff = pd.DataFrame({'ET': ['12:30','14:00','00:0n','16:00']})

# # check for invalid values using regular expressions
# invalid_mask = dataStaff['ET'].apply(lambda x: bool(re.search(r'^(?:(?:([01]?\d|2[0-3]):)?([0-5]?\d):[0-5]?[0-9]n$', x)))

# # check for invalid values
# print(dataStaff[invalid_mask])
# Convert columns to datetime data type with 'coerce' error handling
dataStaff['ET'] = pd.to_datetime(dataStaff['ET'], format='%H:%M', errors='coerce')

# check for NaT values
print(dataStaff[pd.isna(dataStaff['ET'])])

      Flight Date Orientation  Flight    ST  ET  RLO   RSM  EO   AA
2        1/9/2022     Arrival  SQ 208    15 NaT   1.0    4   1  2.0
4        1/9/2022     Arrival  SQ 242    20 NaT   1.0    3   1  1.0
11       1/9/2022     Arrival   SQ 11   115 NaT   1.0    3   1  2.0
22       1/9/2022     Arrival   TR 25   355 NaT   1.0    3   1  1.0
23       1/9/2022     Arrival  TR 509   405 NaT   1.0    3   1  2.0
...           ...         ...     ...   ...  ..   ...  ...  ..  ...
20208  30-11-2022     Arrival  SQ 193  2315 NaT   1.0    2   1  1.0
20209  30-11-2022     Arrival  TR 653  2315 NaT   1.0    2   1  1.0
20210  30-11-2022     Arrival  SQ 713  2330 NaT   1.0    2   1  1.0
20212  30-11-2022     Arrival  TR 617  2340 NaT   1.0    3   1  1.0
20218  30-11-2022     Arrival  SQ 897  2355 NaT   1.0    1   1  1.0

[10113 rows x 9 columns]

In [175]:
# delete all rows with NaT values in the 'ET' column
dataStaff = dataStaff.dropna(subset=['ET'])

In [160]:
# Convert columns to numeric data type with 'coerce' error handling
dataStaff['ET'] = pd.to_numeric(dataStaff['ET'], errors='coerce')

# check for NaN values
# print(dataStaff[pd.isna(dataStaff['ET'])])

In [161]:
print(dataStaff[pd.isna(dataStaff['ET'])])

      Flight Date Orientation  Flight    ST  ET  RLO   RSM  EO   AA
30       1/9/2022     Arrival  TR 713   520 NaN   0.0    0   0  0.0
461      3/9/2022     Arrival  TR 509   405 NaN   0.0    0   0  0.0
462      3/9/2022     Arrival  TR 713   410 NaN   0.0    0   0  0.0
1428     7/9/2022     Arrival  SQ 896  1532 NaN   0.0    0   0  0.0
1433     7/9/2022     Arrival  SQ 896  1551 NaN   0.0    0   0  0.0
1654     8/9/2022     Arrival  TR 809  1630 NaN   0.0    0   0  0.0
1884     9/9/2022     Arrival  SQ 333  1730 NaN   0.0    0   0  0.0
2047    10/9/2022     Arrival  SQ 192   933 NaN   0.0    0   0  0.0
2052    10/9/2022     Arrival  SQ 192   951 NaN   0.0    0   0  0.0
2321    11/9/2022     Arrival  SQ 939  1550 NaN   1.0    3   1  2.0
3136   15-09-2022     Arrival  SQ 334  1414 NaN   0.0    0   0  0.0
3794   18-09-2022     Arrival  SQ 326  1137 NaN   0.0    0   0  0.0
4644   22-09-2022     Arrival  SQ 912  1229 NaN   0.0    0   0  0.0
6318   30-09-2022     Arrival  TR 848   649 NaN   0.0    0   0  0.0
9954   17-10-2022     Arrival  SQ 423   740 NaN   0.0    0   0  0.0
10915  21-10-2022     Arrival   SQ 36  1859 NaN   0.0    0   0  0.0
10917  21-10-2022     Arrival   SQ 36  1901 NaN   0.0    0   0  0.0
12666  29-10-2022     Arrival  SQ 186  1754 NaN   0.0    0   0  0.0
12997  31-10-2022     Arrival  SQ 306   555 NaN   0.0    0   0  0.0
13866   4/11/2022     Arrival  SQ 402   300 NaN   0.0    0   0  0.0
14169   5/11/2022     Arrival  SQ 936   914 NaN   0.0    0   0  0.0
14418   6/11/2022     Arrival  SQ 192   951 NaN   0.0    0   0  0.0
14477   6/11/2022     Arrival   SQ 21  1715 NaN   NaN    0   0  NaN
14730   7/11/2022     Arrival  SQ 186  1851 NaN   0.0    0   0  0.0
15252  10/11/2022     Arrival   TR 25   225 NaN   0.0    0   0  0.0
17832  20-11-2022     Arrival  SQ 528  2137 NaN   0.0    0   0  0.0
18868  25-11-2022     Arrival  SQ 317   750 NaN   0.0    0   0  0.0
19414  27-11-2022     Arrival  SQ 184  1424 NaN   0.0    0   0  0.0

In [143]:
# convert ET to datetime by adding : in the middle
# dataStaff['ET']=pd.to_datetime(dataStaff['ET'], format='%H%M').dt.strftime('%H:%M')
dataStaff['ET'] = pd.to_datetime(dataStaff['ET'].astype(str), format='%H%M', errors='coerce')

# check for NaT values
print(dataStaff[pd.isna(dataStaff['ET'])])

# pd.to_datetime(df['time'], format='%H%M').dt.strftime('%H:%M')
# dataStaff['ET']=pd.to_datetime(dataStaff['ET'], format='%H:%M').dt.strftime('%H:%M')

      Flight Date Orientation  Flight    ST  ET  RLO   RSM  EO   AA
30       1/9/2022     Arrival  TR 713   520 NaT   0.0    0   0  0.0
461      3/9/2022     Arrival  TR 509   405 NaT   0.0    0   0  0.0
462      3/9/2022     Arrival  TR 713   410 NaT   0.0    0   0  0.0
1428     7/9/2022     Arrival  SQ 896  1532 NaT   0.0    0   0  0.0
1433     7/9/2022     Arrival  SQ 896  1551 NaT   0.0    0   0  0.0
1654     8/9/2022     Arrival  TR 809  1630 NaT   0.0    0   0  0.0
1884     9/9/2022     Arrival  SQ 333  1730 NaT   0.0    0   0  0.0
2047    10/9/2022     Arrival  SQ 192   933 NaT   0.0    0   0  0.0
2052    10/9/2022     Arrival  SQ 192   951 NaT   0.0    0   0  0.0
2321    11/9/2022     Arrival  SQ 939  1550 NaT   1.0    3   1  2.0
3136   15-09-2022     Arrival  SQ 334  1414 NaT   0.0    0   0  0.0
3794   18-09-2022     Arrival  SQ 326  1137 NaT   0.0    0   0  0.0
4644   22-09-2022     Arrival  SQ 912  1229 NaT   0.0    0   0  0.0
6318   30-09-2022     Arrival  TR 848   649 NaT   0.0    0   0  0.0
9954   17-10-2022     Arrival  SQ 423   740 NaT   0.0    0   0  0.0
10915  21-10-2022     Arrival   SQ 36  1859 NaT   0.0    0   0  0.0
10917  21-10-2022     Arrival   SQ 36  1901 NaT   0.0    0   0  0.0
12666  29-10-2022     Arrival  SQ 186  1754 NaT   0.0    0   0  0.0
12997  31-10-2022     Arrival  SQ 306   555 NaT   0.0    0   0  0.0
13866   4/11/2022     Arrival  SQ 402   300 NaT   0.0    0   0  0.0
14169   5/11/2022     Arrival  SQ 936   914 NaT   0.0    0   0  0.0
14418   6/11/2022     Arrival  SQ 192   951 NaT   0.0    0   0  0.0
14477   6/11/2022     Arrival   SQ 21  1715 NaT   NaN    0   0  NaN
14730   7/11/2022     Arrival  SQ 186  1851 NaT   0.0    0   0  0.0
15252  10/11/2022     Arrival   TR 25   225 NaT   0.0    0   0  0.0
17832  20-11-2022     Arrival  SQ 528  2137 NaT   0.0    0   0  0.0
18868  25-11-2022     Arrival  SQ 317   750 NaT   0.0    0   0  0.0
19414  27-11-2022     Arrival  SQ 184  1424 NaT   0.0    0   0  0.0

In [11]:
dataStaff.columns
# fill NAN with 0
dataStaff['AA'].fillna(0,inplace=True)
dataStaff['RLO '].fillna(0,inplace=True)
# data['RLO'].isnull.sum()

In [12]:
dataStaff['staff']=dataStaff['RSM']+dataStaff['EO']+dataStaff['AA']+dataStaff['RLO ']

In [13]:

dataStaff['staff'].isnull().sum()

0

In [14]:
# display data where staff is null
dataStaff[dataStaff['staff'].isnull()]

Empty DataFrame
Columns: [Flight Date, Orientation, Flight, ST, ET, RLO , RSM, EO, AA, staff]
Index: []

In [15]:
dataStaff['ET']=dataStaff['ET'].astype('str')

In [16]:
# remove the decimal point from the ET column:
dataStaff['ET']=dataStaff['ET'].str.replace('.0','')

# dataStaff['ET']=dataStaff['ET'].str.strip('.')[0]

C:\Users\pc\AppData\Local\Temp\ipykernel_31376\806292004.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  dataStaff['ET']=dataStaff['ET'].str.replace('.0','')

In [17]:
dataStaff=dataStaff[dataStaff['Orientation']=='Arrival']

In [179]:
dataStaff.head()

,Flight Date,Orientation,Flight,ST,ET,RLO,RSM,EO,AA,staff
2,1/9/2022,Arrival,SQ 208,15,1900-01-01 00:21:00,1.0,4,1,2.0,8.0
4,1/9/2022,Arrival,SQ 242,20,1900-01-01 00:40:00,1.0,3,1,1.0,6.0
11,1/9/2022,Arrival,SQ 11,115,1900-01-01 00:38:00,1.0,3,1,2.0,7.0
22,1/9/2022,Arrival,TR 25,355,1900-01-01 03:55:00,1.0,3,1,1.0,6.0
23,1/9/2022,Arrival,TR 509,405,1900-01-01 05:10:00,1.0,3,1,2.0,7.0

In [18]:
dataStaff.shape

(10113, 10)

In [180]:
# dataStaff ET to hours:minutes
dataStaff['ET']=pd.to_datetime(dataStaff['ET'], format='%H:%M').dt.strftime('%H:%M')

In [19]:
dataStaff.tail()

      Flight Date Orientation  Flight    ST   ET  RLO   RSM  EO   AA  staff
20208  30-11-2022     Arrival  SQ 193  2315  NaT   1.0    2   1  1.0    5.0
20209  30-11-2022     Arrival  TR 653  2315  NaT   1.0    2   1  1.0    5.0
20210  30-11-2022     Arrival  SQ 713  2330  NaT   1.0    2   1  1.0    5.0
20212  30-11-2022     Arrival  TR 617  2340  NaT   1.0    3   1  1.0    6.0
20218  30-11-2022     Arrival  SQ 897  2355  NaT   1.0    1   1  1.0    4.0

In [24]:
# save the data
data.to_excel('J:\\SATS\\CLEAN_SATS_RAM.xlsx')

In [20]:
#  group and count all the flights by staff
data.groupby('staff')['Flight'].count()

NameError: name 'data' is not defined

# Read clean STAT RAM

In [106]:
import pandas as pd
dataStaff=pd.read_excel('J:\\SATS\\CLEAN_SATS_RAM.xlsx')

In [108]:
dataStaff.head()

,Unnamed: 0,Flight Date,Orientation,Flight,ST,ET,RLO,RSM,EO,AA,staff
0,0,2022-09-01,Departure,SQ 225,5,21.0,1,3,1,2,7
1,1,2022-09-01,Departure,SQ 608,10,11.0,1,3,0,2,6
2,2,2022-09-01,Arrival,SQ 208,15,21.0,1,4,1,2,8
3,3,2022-09-01,Departure,SQ 336,15,21.0,1,3,1,2,7
4,4,2022-09-01,Arrival,SQ 242,20,40.0,1,3,1,1,6

In [105]:
# dataBugagge=pd.read_excel('J:\\SATS\\Buggage.xlsx')

In [44]:
#  remove where Flight No, Flight Date and In-bound Time all three are duplicated all together:
# data1.drop_duplicates(subset=['Flight No','Flight Date','In-bound Time'],keep='first',inplace=True)

In [109]:
dataStaff.shape

(20219, 11)

In [110]:
# remove the space in between the flight number

dataStaff['Flight']=dataStaff['Flight'].str.strip()
dataStaff['Flight'] = dataStaff['Flight'].str.replace(' ', '')
dataStaff['Flight'].head()

0    SQ225
1    SQ608
2    SQ208
3    SQ336
4    SQ242
Name: Flight, dtype: object

In [111]:
dataStaff=dataStaff[dataStaff['Orientation']=='Arrival']
dataStaff.shape

(10113, 11)

In [112]:
# remove any rows where the Orientation is not Arrival
dataStaff=dataStaff[dataStaff['Orientation']=='Arrival']

In [113]:
dataStaff.shape

(10113, 11)

In [301]:
# set the date column as pandas date
# dataStaff['Flight Date']=pd.to_datetime(dataStaff['Flight Date'])
# arrivalFlights['Flight Date']=pd.to_datetime(arrivalFlights['Flight Date'])

C:\Users\pc\AppData\Local\Temp\ipykernel_28092\33504595.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  arrivalFlights['Flight Date']=pd.to_datetime(arrivalFlights['Flight Date'])

In [52]:
# arrivalFlights['Flight Date'].head()

NameError: name 'arrivalFlights' is not defined

# Data Bugagge

In [66]:
# dataBugagge['Flight Date']=pd.to_datetime(dataBugagge['Flight Date'])
import pandas as pd
dataBugagge=pd.read_excel('J:\\SATS\\Buggage.xlsx',sheet_name='in',encoding='utf-8-sig')

TypeError: read_excel() got an unexpected keyword argument 'encoding'

In [69]:
dataBugagge['Flight No'].iloc[2]

'SQ208'

In [67]:
dataBugagge['Flight No'] = dataBugagge['Flight No'].str.replace('\ufeff','')

In [68]:
dataBugagge['Flight No'] = dataBugagge['Flight No'].str.lstrip()

In [57]:
dataBugagge['Flight Date'].head()

0   2022-09-01
1   2022-09-01
2   2022-09-01
3   2022-09-01
4   2022-09-01
Name: Flight Date, dtype: datetime64[ns]

In [70]:
# any Flight No with leading \ufeff?
dataBugagge['Flight No'].str.contains('\ufeff').sum()

0

In [58]:
dataBugagge.columns

Index(['Flight No', 'Flight Date', 'In-bound Time', 'Trip Number',
       'ULD Number', 'Pickup Time', 'Dropoff Time'],
      dtype='object')

In [73]:
# dataBugagge['Drop Off Time']=pd.to_datetime(dataBugagge['Drop Off Time'])
# set the Drop Off Time for each day the maximum one:
dataBugagge['Dropoff TimeN']=dataBugagge.groupby(['Flight Date','Flight No'])['Dropoff Time'].transform('max')

In [74]:
dataBugagge['Flight No'].iloc[2]

'SQ208'

In [12]:
dataBugagge['Dropoff Time'].isnull().sum()
# fill null values with 0 datetime
dataBugagge['Dropoff Time'].fillna(pd.to_datetime('00:00'),inplace=True)

In [14]:
dataBugagge.isnull().sum()

Flight No            0
Flight Date          1
In-bound Time       73
Trip Number          1
ULD Number           1
Pickup Time      46992
Dropoff Time         0
dtype: int64

## Trip number against each flight

In [71]:
# count trips by flight number each day and save it to a new column:
dataBugagge['Total ULDS']=dataBugagge.groupby(['Flight Date','Flight No'])['Trip Number'].transform('count')
# dataBugagge.groupby(['Flight Date','Flight No'])['Trip Number'].count()

In [46]:
dataBugagge['Total ULDS']=dataBugagge.groupby(['Flight Date','Flight No'])['Trip Number'].transform('count')

In [47]:
# dataBugagge
# drop the duplicate rows
dataBugagge.drop_duplicates(subset=['Flight Date','Flight No'],keep='first',inplace=True)

In [72]:
dataBugagge.head()

,Flight No,Flight Date,In-bound Time,Trip Number,ULD Number,Pickup Time,Dropoff Time,Total ULDS
0,SQ208,2022-09-01,2022-09-01 00:21:00,1.0,AKE89138SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.930,12.0
1,SQ208,2022-09-01,2022-09-01 00:21:00,1.0,AKE29231SQ,2022-09-01 00:33:15.217,2022-09-01 00:37:16.930,12.0
2,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE28054SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933,12.0
3,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE87419SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933,12.0
4,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE80186SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933,12.0

In [75]:
dataBugagge.drop_duplicates(subset=['Flight Date','Flight No'],keep='first',inplace=True)

In [63]:
# get Flight No at first index
dataBugagge['Flight No'].iloc[2]

# dataBugagge['Flight No']=='SQ208'

'\ufeffSQ208'

In [33]:
# remove empty In-bound Time rows
dataBugagge=dataBugagge[dataBugagge['In-bound Time'].notnull()]

In [73]:
dataBugagge.columns

Index(['Flight No', 'Flight Date', 'In-bound Time', 'Trip Number',
       'ULD Number', 'Pickup Time', 'Dropoff Time', 'Total Trips'],
      dtype='object')

In [251]:
dataBugagge['In-bound Time'].isnull().sum()

0

In [240]:
# In-bound Time to string
dataBugagge['In-bound Time']=dataBugagge['In-bound Time'].astype(str)

In [45]:
dataBugagge['In-bound Time'].head()

0    2022-09-01 00:21:00
2    2022-09-01 00:21:00
12   2022-09-01 00:38:00
25   2022-09-01 00:40:00
29   2022-09-01 03:55:00
Name: In-bound Time, dtype: datetime64[ns]

In [242]:
# remove last three characters
dataBugagge['In-bound Time']=dataBugagge['In-bound Time'].str[:-3]

In [37]:
# trim Flight No
dataBugagge['Flight No']=dataBugagge['Flight No'].str.strip()

In [76]:
dataBugagge.head()

,Flight No,Flight Date,In-bound Time,Trip Number,ULD Number,Pickup Time,Dropoff Time,Total ULDS,Dropoff TimeN
0,SQ208,2022-09-01,2022-09-01 00:21:00,1.0,AKE89138SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.930,12.0,2022-09-01 00:48:19.477
12,SQ11,2022-09-01,2022-09-01 00:38:00,1.0,AKE70581SQ,NaT,NaT,13.0,NaT
25,SQ242,2022-09-01,2022-09-01 00:40:00,1.0,AKE80436SQ,2022-09-01 00:54:23.003,2022-09-01 00:55:44.893,4.0,2022-09-01 00:55:44.900
29,TR25,2022-09-01,2022-09-01 03:55:00,1.0,AKE84300SQ,2022-09-01 04:17:01.517,2022-09-01 04:22:18.260,11.0,2022-09-01 04:38:25.783
40,TR541,2022-09-01,2022-09-01 04:04:00,1.0,BT804,NaT,NaT,4.0,NaT

In [77]:
# save dataBugagge
dataBugagge.to_excel('J:\\SATS\\Count_BUGAGGE.xlsx')

In [252]:
# convrt to HH:MM
dataBugagge['In-bound Time']=pd.to_datetime(dataBugagge['In-bound Time'], format='%Y-%m-%d %H:%M:%S').dt.strftime('%H:%M')

In [47]:
dataBugagge.tail()

,Flight No,Flight Date,In-bound Time,Trip Number,ULD Number,Pickup Time,Dropoff Time,Total Trips
73763,SQ105,2022-10-12,NaT,1.0,AKE84181SQ,2022-10-12 12:12:09.163,2022-10-12 12:13:25.653,5.0
73764,SQ224,2022-10-13,NaT,1.0,AKE86114SQ,2022-10-13 11:59:19.587,NaT,6.0
73767,TR391,2022-10-13,NaT,1.0,AKE11841TR,2022-10-13 23:37:47.297,2022-10-13 23:37:58.297,5.0
73768,SQ157,2022-10-13,NaT,1.0,BTBULK,NaT,NaT,5.0
73817,_x001A_,NaT,NaT,NaN,NaN,NaT,NaT,NaN

In [243]:
# remove first two characters
# dataBugagge['In-bound Time']=dataBugagge['In-bound Time'].str[11:]

In [304]:
dataBugagge['In-bound Time'].head()

0     00:21
2     00:21
12    00:38
25    00:40
29    03:55
Name: In-bound Time, dtype: object

In [245]:
# dataBugagge['In-bound Time'].tail()

73813
73814
73815
73816
73817
Name: In-bound Time, dtype: object

In [215]:
# convert to HH:MM
# drop all null values
# dataBugagge.dropna(subset=['In-bound Time'],inplace=True)



# dataBugagge['In-bound Time']=pd.to_datetime(dataBugagge['In-bound Time'], format='%H:%M').dt.strftime('%H:%M')

In [216]:
# dataBugagge['In-bound Time']=pd.to_datetime(dataBugagge['In-bound Time'], format='%H:%M').dt.strftime('%H:%M')

ValueError: time data '' does not match format '%H:%M' (match)

In [197]:
# convrt to HH:MM
# dataBugagge['In-bound Time']=pd.to_datetime(dataBugagge['In-bound Time'], format='%Y-%m-%d %H:%M:%S').dt.strftime('%H:%M')

In [194]:
# dataBugagge['In-bound Time']=dataBugagge['In-bound Time'].astype(str)

In [198]:
# dataBugagge['In-bound Time'].head()

0    00:21
1    00:21
2    00:21
3    00:21
4    00:21
Name: In-bound Time, dtype: object

In [76]:
# dataBugagge['In-bound Time']=dataBugagge['In-bound Time'].str.split(' ').str[1]

In [77]:
# dataBugagge['In-bound Time'].head()

0    00:21:00
1    00:21:00
2    00:21:00
3    00:21:00
4    00:21:00
Name: In-bound Time, dtype: object

In [78]:
# dataBugagge['In-bound Time']=dataBugagge['In-bound Time'][3:]
# remove first 3 characters
# dataBugagge['In-bound Time']=dataBugagge['In-bound Time'].str[3:]

In [305]:
dataBugagge.head()

,Flight No,Flight Date,In-bound Time,Trip Number,ULD Number,Pickup Time,Dropoff Time
0,SQ208,2022-09-01,00:21,1.0,AKE89138SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.930
2,SQ208,2022-09-01,00:21,2.0,AKE28054SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933
12,SQ11,2022-09-01,00:38,1.0,AKE70581SQ,NaT,NaT
25,SQ242,2022-09-01,00:40,1.0,AKE80436SQ,2022-09-01 00:54:23.003,2022-09-01 00:55:44.893
29,TR25,2022-09-01,03:55,1.0,AKE84300SQ,2022-09-01 04:17:01.517,2022-09-01 04:22:18.260

In [81]:
# dataBugagge['In-bound Time']=dataBugagge['In-bound Time'].str.replace(',',':')
# remove all the duplicates Flight No, Flight Date and In-bound Time all togather and keep the first one but Dropp-of-Time keep the last one:
dataBugagge.drop_duplicates(subset=['Flight No','Flight Date','In-bound Time'],keep='first',inplace=True)
dataBugagge.drop_duplicates(subset=['Flight No','Flight Date','In-bound Time'],keep='first',inplace=True)

# Handing drop of column

In [3]:
dataBugagge.columns

NameError: name 'dataBugagge' is not defined

In [82]:
dataBugagge.head

<bound method NDFrame.head of       Flight No Flight Date In-bound Time  Trip Number  ULD Number  \
0         SQ208  2022-09-01         21:00          1.0  AKE89138SQ
2        SQ208  2022-09-01         21:00          2.0  AKE28054SQ
12         SQ11  2022-09-01         38:00          1.0  AKE70581SQ
25        SQ242  2022-09-01         40:00          1.0  AKE80436SQ
29         TR25  2022-09-01         55:00          1.0  AKE84300SQ
...         ...         ...           ...          ...         ...
73763     SQ105  2022-10-12           NaN          1.0  AKE84181SQ
73764     SQ224  2022-10-13           NaN          1.0  AKE86114SQ
73767     TR391  2022-10-13           NaN          1.0  AKE11841TR
73768     SQ157  2022-10-13           NaN          1.0      BTBULK
73817   _x001A_         NaT           NaN          NaN         NaN

                  Pickup Time            Dropoff Time
0     2022-09-01 00:33:15.220 2022-09-01 00:37:16.930
2     2022-09-01 00:33:15.220 2022-09-01 00:37:16.933
12                        NaT                     NaT
25    2022-09-01 00:54:23.003 2022-09-01 00:55:44.893
29    2022-09-01 04:17:01.517 2022-09-01 04:22:18.260
...                       ...                     ...
73763 2022-10-12 12:12:09.163 2022-10-12 12:13:25.653
73764 2022-10-13 11:59:19.587                     NaT
73767 2022-10-13 23:37:47.297 2022-10-13 23:37:58.297
73768                     NaT                     NaT
73817                     NaT                     NaT

[8011 rows x 7 columns]>

In [109]:
dataBugagge.head()

,Flight No,Flight Date,In-bound Time,Trip Number,ULD Number,Pickup Time,Dropoff Time
0,SQ208,2022-09-01,2022-09-01 00:21:00,1.0,AKE89138SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.930
1,SQ208,2022-09-01,2022-09-01 00:21:00,1.0,AKE29231SQ,2022-09-01 00:33:15.217,2022-09-01 00:37:16.930
2,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE28054SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933
3,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE87419SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933
4,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE80186SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933

In [110]:
dataStaff.head()

,Unnamed: 0,Flight Date,Orientation,Flight,ST,ET,RLO,RSM,EO,AA,staff
2,2,2022-09-01,Arrival,SQ 208,15,21.0,1,4,1,2,8
4,4,2022-09-01,Arrival,SQ 242,20,40.0,1,3,1,1,6
11,11,2022-09-01,Arrival,SQ 11,115,38.0,1,3,1,2,7
22,22,2022-09-01,Arrival,TR 25,355,355.0,1,3,1,1,6
23,23,2022-09-01,Arrival,TR 509,405,510.0,1,3,1,2,7

In [111]:
dataBugagge.head()

,Flight No,Flight Date,In-bound Time,Trip Number,ULD Number,Pickup Time,Dropoff Time
0,SQ208,2022-09-01,2022-09-01 00:21:00,1.0,AKE89138SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.930
1,SQ208,2022-09-01,2022-09-01 00:21:00,1.0,AKE29231SQ,2022-09-01 00:33:15.217,2022-09-01 00:37:16.930
2,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE28054SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933
3,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE87419SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933
4,SQ208,2022-09-01,2022-09-01 00:21:00,2.0,AKE80186SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.933

In [112]:
dataBugagge.dtypes

Flight No                object
Flight Date      datetime64[ns]
In-bound Time    datetime64[ns]
Trip Number             float64
ULD Number               object
Pickup Time      datetime64[ns]
Dropoff Time     datetime64[ns]
dtype: object

In [308]:
dataStaff['ET'] = pd.to_datetime(dataStaff['ET'], format='%H:%M', errors='coerce')

# check for NaT values
print(dataStaff[pd.isna(dataStaff['ET'])])

       Unnamed: 0 Flight Date Orientation Flight    ST  ET  RLO   RSM  EO  AA  \
0               0  2022-09-01   Departure  SQ225     5 NaT     1    3   1   2
1               1  2022-09-01   Departure  SQ608    10 NaT     1    3   0   2
2               2  2022-09-01     Arrival  SQ208    15 NaT     1    4   1   2
3               3  2022-09-01   Departure  SQ336    15 NaT     1    3   1   2
4               4  2022-09-01     Arrival  SQ242    20 NaT     1    3   1   1
...           ...         ...         ...    ...   ...  ..   ...  ...  ..  ..
20214       20214  2022-11-30   Departure  SQ378  2345 NaT     1    3   1   2
20215       20215  2022-11-30   Departure   SQ26  2355 NaT     1    3   1   2
20216       20216  2022-11-30   Departure  SQ324  2355 NaT     1    2   1   1
20217       20217  2022-11-30   Departure  SQ638  2355 NaT     1    3   1   1
20218       20218  2022-11-30     Arrival  SQ897  2355 NaT     1    1   1   1

       staff
0          7
1          6
2          8
3          7
4          6
...      ...
20214      7
20215      7
20216      5
20217      6
20218      4

[20219 rows x 11 columns]

In [311]:
dataStaff['ET']=pd.to_datetime(dataStaff['ET'], format='%H:%M').dt.strftime('%H:%M')

In [113]:
dataStaff.dtypes

Unnamed: 0              int64
Flight Date    datetime64[ns]
Orientation            object
Flight                 object
ST                      int64
ET                    float64
RLO                     int64
RSM                     int64
EO                      int64
AA                      int64
staff                   int64
dtype: object

In [313]:
# datastagg Flight Date to pandas date YYYY-MM-DD:

dataStaff['Flight Date']=pd.to_datetime(dataStaff['Flight Date'], format='%Y-%m-%d', errors='coerce')

In [314]:
dataStaff.tail()

,Unnamed: 0,Flight Date,Orientation,Flight,ST,ET,RLO,RSM,EO,AA,staff
20214,20214,2022-11-30,Departure,SQ378,2345,NaN,1,3,1,2,7
20215,20215,2022-11-30,Departure,SQ26,2355,NaN,1,3,1,2,7
20216,20216,2022-11-30,Departure,SQ324,2355,NaN,1,2,1,1,5
20217,20217,2022-11-30,Departure,SQ638,2355,NaN,1,3,1,1,6
20218,20218,2022-11-30,Arrival,SQ897,2355,NaN,1,1,1,1,4

In [54]:
dataStaff.dtypes

Unnamed: 0              int64
Flight Date    datetime64[ns]
Orientation            object
Flight                 object
ST                      int64
ET                    float64
RLO                     int64
RSM                     int64
EO                      int64
AA                      int64
staff                   int64
dtype: object

In [315]:
dataBugagge.tail()

,Flight No,Flight Date,In-bound Time,Trip Number,ULD Number,Pickup Time,Dropoff Time
73726,TR493,2022-11-30,23:14,1.0,BT2163,NaT,NaT
73729,SQ185,2022-11-30,23:19,0.0,AKE28070SQ,NaT,2022-11-30 23:54:44.753
73734,SQ906,2022-11-30,23:27,1.0,BT1483,NaT,NaT
73737,TR617,2022-11-30,23:53,1.0,AKE83265SQ,2022-12-01 00:10:20.050,NaT
73739,SQ739,2022-11-30,00:11,1.0,BT1218,NaT,NaT

In [114]:
dataBugagge.dtypes

Flight No                object
Flight Date      datetime64[ns]
In-bound Time    datetime64[ns]
Trip Number             float64
ULD Number               object
Pickup Time      datetime64[ns]
Dropoff Time     datetime64[ns]
dtype: object

In [317]:
dataBugagge['Flight Date']=pd.to_datetime(dataBugagge['Flight Date'], format='%Y-%m-%d', errors='coerce')

In [233]:
# ET datatype to HH:MM
dataStaff['ET']=pd.to_datetime(dataStaff['ET'], format='%H:%M').dt.strftime('%H:%M')
# dataBugagge In-bound Time is not null
dataBugagge=dataBugagge.dropna(subset=['In-bound Time'],inplace=True)
# dataBugagge[dataBugagge['In-bound Time']==]
# dataBugagge['In-bound Time']=pd.to_datetime(dataBugagge['In-bound Time'], format='%H:%M').dt.strftime('%H:%M')

TypeError: 'NoneType' object is not subscriptable

In [258]:
dataBugagge.dtypes

Flight No                object
Flight Date      datetime64[ns]
In-bound Time            object
Trip Number             float64
ULD Number               object
Pickup Time      datetime64[ns]
Dropoff Time     datetime64[ns]
dtype: object

In [78]:
dataStaff.dtypes

NameError: name 'dataStaff' is not defined

In [56]:
dataStaff.head()

,Unnamed: 0,Flight Date,Orientation,Flight,ST,ET,RLO,RSM,EO,AA,staff
2,2,2022-09-01,Arrival,SQ208,15,21.0,1,4,1,2,8
4,4,2022-09-01,Arrival,SQ242,20,40.0,1,3,1,1,6
11,11,2022-09-01,Arrival,SQ11,115,38.0,1,3,1,2,7
22,22,2022-09-01,Arrival,TR25,355,355.0,1,3,1,1,6
23,23,2022-09-01,Arrival,TR509,405,510.0,1,3,1,2,7

In [83]:
# remove all the duplicates Flight, Flight Date:
dataStaff.drop_duplicates(subset=['Flight','Flight Date'],keep='first',inplace=True)

In [84]:
dataStaff.shape

(10108, 11)

In [59]:
# remove all the duplicates Flight No, Flight Date:
dataBugagge.drop_duplicates(subset=['Flight No','Flight Date'],keep='first',inplace=True)

In [85]:
dataBugagge.shape

(8008, 9)

In [61]:
dataStaff.shape

(10108, 11)

In [62]:
dataStaff.drop_duplicates(subset=['Flight','Flight Date'],keep='first',inplace=True)

In [87]:
# merge dataStaff and dataBugagge on Flight, Flight Date, In-bound Time
# rename Flight to Flight No, ET to In-bound Time
dataStaff.rename(columns={'Flight':'Flight No'},inplace=True)
# dataStaffBugagge=pd.merge(dataStaff,dataBugagge,how='inner',on=['Flight','Flight Date','In-bound Time'])

In [348]:
dataBugagge['Flight Date']

0       2022-09-01
2       2022-09-01
12      2022-09-01
25      2022-09-01
29      2022-09-01
           ...
73726   2022-11-30
73729   2022-11-30
73734   2022-11-30
73737   2022-11-30
73739   2022-11-30
Name: Flight Date, Length: 7999, dtype: datetime64[ns]

In [347]:
dataStaff['Flight Date']

2       2022-09-01
4       2022-09-01
11      2022-09-01
22      2022-09-01
23      2022-09-01
           ...
20208   2022-11-30
20209   2022-11-30
20210   2022-11-30
20212   2022-11-30
20218   2022-11-30
Name: Flight Date, Length: 10108, dtype: datetime64[ns]

In [64]:
# intersect dataStaff and dataBugagge on Flight No on 2022-09-01:
dataBugagge['Flight No'].isin(dataStaff['Flight No']).loc[dataBugagge['Flight Date']=='2022-09-01'].sum()

68

In [88]:
dataStaffBugagge=pd.merge(dataStaff,dataBugagge,how='outer',on=['Flight No','Flight Date'])

In [89]:
dataStaffBugagge.head()

,Unnamed: 0,Flight Date,Orientation,Flight No,ST,ET,RLO,RSM,EO,AA,staff,In-bound Time,Trip Number,ULD Number,Pickup Time,Dropoff Time,Total ULDS,Dropoff TimeN
0,2.0,2022-09-01,Arrival,SQ208,15.0,21.0,1.0,4.0,1.0,2.0,8.0,2022-09-01 00:21:00,1.0,AKE89138SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.930,12.0,2022-09-01 00:48:19.477
1,4.0,2022-09-01,Arrival,SQ242,20.0,40.0,1.0,3.0,1.0,1.0,6.0,2022-09-01 00:40:00,1.0,AKE80436SQ,2022-09-01 00:54:23.003,2022-09-01 00:55:44.893,4.0,2022-09-01 00:55:44.900
2,11.0,2022-09-01,Arrival,SQ11,115.0,38.0,1.0,3.0,1.0,2.0,7.0,2022-09-01 00:38:00,1.0,AKE70581SQ,NaT,NaT,13.0,NaT
3,22.0,2022-09-01,Arrival,TR25,355.0,355.0,1.0,3.0,1.0,1.0,6.0,2022-09-01 03:55:00,1.0,AKE84300SQ,2022-09-01 04:17:01.517,2022-09-01 04:22:18.260,11.0,2022-09-01 04:38:25.783
4,23.0,2022-09-01,Arrival,TR509,405.0,510.0,1.0,3.0,1.0,2.0,7.0,NaT,NaN,NaN,NaT,NaT,NaN,NaT

In [90]:
dataStaffBugagge.drop(columns=['Unnamed: 0','Trip Number','Dropoff Time'],inplace=True)

In [91]:
dataStaffBugagge.head()

,Flight Date,Orientation,Flight No,ST,ET,RLO,RSM,EO,AA,staff,In-bound Time,ULD Number,Pickup Time,Total ULDS,Dropoff TimeN
0,2022-09-01,Arrival,SQ208,15.0,21.0,1.0,4.0,1.0,2.0,8.0,2022-09-01 00:21:00,AKE89138SQ,2022-09-01 00:33:15.220,12.0,2022-09-01 00:48:19.477
1,2022-09-01,Arrival,SQ242,20.0,40.0,1.0,3.0,1.0,1.0,6.0,2022-09-01 00:40:00,AKE80436SQ,2022-09-01 00:54:23.003,4.0,2022-09-01 00:55:44.900
2,2022-09-01,Arrival,SQ11,115.0,38.0,1.0,3.0,1.0,2.0,7.0,2022-09-01 00:38:00,AKE70581SQ,NaT,13.0,NaT
3,2022-09-01,Arrival,TR25,355.0,355.0,1.0,3.0,1.0,1.0,6.0,2022-09-01 03:55:00,AKE84300SQ,2022-09-01 04:17:01.517,11.0,2022-09-01 04:38:25.783
4,2022-09-01,Arrival,TR509,405.0,510.0,1.0,3.0,1.0,2.0,7.0,NaT,NaN,NaT,NaN,NaT

In [92]:
dataStaffBugagge.shape

(11808, 15)

In [78]:
# save to csv
dataStaffBugagge.to_csv('J:\\SATS\\dataStaffBugagge3.csv',index=False)

In [97]:
dataStaffBugagge.shape

(11808, 15)

In [98]:
# drop all the Orientation where Flight not 'Arrival'
dataStaffBugagge.drop(dataStaffBugagge[dataStaffBugagge['Orientation']!='Arrival'].index,inplace=True)

In [99]:
dataStaffBugagge.shape

(10108, 15)

In [100]:
dataStaff.shape

(10113, 9)

In [101]:
# drop all the Orientation where Flight not 'Arrival'
dataStaff.drop(dataStaff[dataStaff['Orientation']!='Arrival'].index,inplace=True)

In [102]:
dataStaff.shape

(10113, 9)

In [116]:
# save sataff to csv
dataStaff.to_csv('J:\\SATS\\dataStaff.csv',index=False)

In [115]:
dataStaffBugagge.shape

(10108, 15)

In [117]:
# save dataStaffBugagge to csv
dataStaffBugagge.to_csv('J:\\SATS\\dataStaffBugagge.csv',index=False)

In [118]:
# why shape is different for dataSaff and dataStaffBugagge
# date wise flights in dataStaff
dataStaff.groupby('Flight Date')['Flight'].count()

Flight Date
2022-09-01    106
2022-09-02    109
2022-09-03    115
2022-09-04    115
2022-09-05    103
             ...
2022-11-26    121
2022-11-27    122
2022-11-28    118
2022-11-29    113
2022-11-30    117
Name: Flight, Length: 91, dtype: int64

In [ ]:
# date wise flights in dataStaffBugagge
dataStaffBugagge.groupby('Flight Date')['Flight No'].count()

In [114]:
# find the difference between dataStaff and dataStaffBugagge on Flight No

dataStaff[~dataStaff['Flight'].isin(dataStaffBugagge['Flight No'])]

Empty DataFrame
Columns: [Unnamed: 0, Flight Date, Orientation, Flight, ST, ET, RLO , RSM, EO, AA, staff]
Index: []

In [272]:
# save dataStaffBugagge to csv
dataStaffBugagge.to_csv('J:\\SATS\\dataStaffBugagge.csv',index=False)

In [327]:
dataStaffBugagge.head()

,Unnamed: 0,Flight Date,Orientation,Flight No,ST,In-bound Time_x,RLO,RSM,EO,AA,staff,In-bound Time_y,Trip Number,ULD Number,Pickup Time,Dropoff Time
0,2,2022-09-01,Arrival,SQ208,15,NaN,1,4,1,2,8,00:21,1.0,AKE89138SQ,2022-09-01 00:33:15.220,2022-09-01 00:37:16.930
1,4,2022-09-01,Arrival,SQ242,20,NaN,1,3,1,1,6,00:40,1.0,AKE80436SQ,2022-09-01 00:54:23.003,2022-09-01 00:55:44.893
2,11,2022-09-01,Arrival,SQ11,115,NaN,1,3,1,2,7,00:38,1.0,AKE70581SQ,NaT,NaT
3,22,2022-09-01,Arrival,TR25,355,NaN,1,3,1,1,6,03:55,1.0,AKE84300SQ,2022-09-01 04:17:01.517,2022-09-01 04:22:18.260
4,24,2022-09-01,Arrival,SQ623,440,NaN,1,3,1,2,7,04:19,1.0,AKE28089SQ,2022-09-01 04:28:10.723,NaT

# Some EDA

In [120]:
Bugagge=pd.read_csv('J:\\SATS\\dataStaffBugagge3.csv')
# dataStaffBugagge3
# dataBugagge=pd.read_excel('J:\\SATS\\Buggage.xlsx')

In [121]:
# total number of flights in one day
# remove all the duplicates Flight No, Flight Date by keeping the DroppOffTime max

Bugagge.drop_duplicates(subset=['Flight No','Flight Date'],keep='first',inplace=True)
# dataBugagge['Flight No'].count()

In [122]:
print(Bugagge.shape)
# find null values in arrival
Bugagge.Orientation.isnull().sum()
# delete all the rows with null values in Orientation
Bugagge.dropna(subset=['Orientation'],inplace=True)

(11810, 17)

In [124]:
print(Bugagge.shape)
print(dataStaff.shape)

(10108, 17)
(10108, 11)

In [94]:
dataStaffBugagge.columns
# find Orientation in dataStaffBugagge
dataStaffBugagge.Orientation.isnull().sum()

1702

In [95]:
# delete all the rows with null values in Orientation
dataStaffBugagge.dropna(subset=['Orientation'],inplace=True)

In [296]:
# total flights every day showing the number of flights against each flight number:
Bugagge.groupby(['Flight Date','Flight No'])['Flight No'].count()
# show the number of flights against each flight number for 1-09-2022
Bugagge.groupby(['Flight Date','Flight No'])['Flight No'].count().loc['2022-09-01']




# Bugagge.groupby(['Flight Date','Flight No']).count()

# Bugagge['Flight No']

Flight No
SQ11      1
SQ121     1
SQ125     1
SQ153     1
SQ157     1
         ..
TR565     1
TR611     1
TR625     1
TR843     1
SQ208    1
Name: Flight No, Length: 81, dtype: int64

In [284]:
# distinct flightNumber on 2022-09-01:



Bugagge[Bugagge['Flight Date']=='2022-09-01']['Flight No']

0       SQ208
2      SQ208
12       SQ11
25      SQ242
29       TR25
        ...
683     SQ185
698     SQ906
705     TR467
710     SQ193
715     TR391
Name: Flight No, Length: 81, dtype: object

In [131]:
# datewise flights in dataStaff and save count in new column:
# dataStaff['Flight Count Staff']=dataStaff.groupby('Flight Date')['Flight'].count()


# dataNew a new dataframe with Flight Date and Flight Count Staff
dataNew=pd.DataFrame(dataStaff.groupby('Flight Date')['Flight'].count())
# dataStaff.groupby('Flight Date')['Flight'].count()
# # save this as new column in dataStaff
# dataNew['Flight Count Staff']=dataStaff.groupby('Flight Date')['Flight'].count()

In [135]:
dataNew.head()
# find where is the difference between Flight and Flight Cout
dataNew[dataNew['Flight']!=dataNew['Flight Count']]

             Flight  Flight Count
Flight Date
2022-09-07      110           109
2022-09-10      114           113
2022-10-21      113           112
2022-10-26      110           109
2022-11-11      126           125

In [133]:
dataNew['Flight Count']=dataStaffBugagge.groupby('Flight Date')['Flight No'].count()

In [129]:
dataStaff.head()

,Unnamed: 0,Flight Date,Orientation,Flight,ST,ET,RLO,RSM,EO,AA,staff,Flight Count Staff,Flight Count BugaggeStaff
2,2,2022-09-01,Arrival,SQ208,15,21.0,1,4,1,2,8,NaN,NaN
4,4,2022-09-01,Arrival,SQ242,20,40.0,1,3,1,1,6,NaN,NaN
11,11,2022-09-01,Arrival,SQ11,115,38.0,1,3,1,2,7,NaN,NaN
22,22,2022-09-01,Arrival,TR25,355,355.0,1,3,1,1,6,NaN,NaN
23,23,2022-09-01,Arrival,TR509,405,510.0,1,3,1,2,7,NaN,NaN

In [124]:
# daewise flights in  dataStaffBugagge
dataStaff['Flight Count BugaggeStaff'] =dataStaffBugagge.groupby('Flight Date')['Flight No'].count()

In [125]:
dataStaff.head()

,Unnamed: 0,Flight Date,Orientation,Flight,ST,ET,RLO,RSM,EO,AA,staff,Flight Count Staff,Flight Count BugaggeStaff
2,2,2022-09-01,Arrival,SQ208,15,21.0,1,4,1,2,8,NaN,NaN
4,4,2022-09-01,Arrival,SQ242,20,40.0,1,3,1,1,6,NaN,NaN
11,11,2022-09-01,Arrival,SQ11,115,38.0,1,3,1,2,7,NaN,NaN
22,22,2022-09-01,Arrival,TR25,355,355.0,1,3,1,1,6,NaN,NaN
23,23,2022-09-01,Arrival,TR509,405,510.0,1,3,1,2,7,NaN,NaN